# DataFrames

In [5]:
import pandas as pd
import numpy as np
import datetime

In [6]:
dt = datetime.datetime(2013,12,1)
end = datetime.datetime(2013,12,8)
step = datetime.timedelta(days=1)

In [9]:
dates = []

while dt < end:
    dates.append(dt.strftime('%m-%d'))
    dt+=step

In [10]:
dates

['12-01', '12-02', '12-03', '12-04', '12-05', '12-06', '12-07']

In [12]:
d = {'Date': dates, 'Tokyo' : [15,19,15,11,9,8,13], 'Paris': [-2,0,2,5,7,-5,-3], 'Mumbai':[20,18,23,19,25,27,23]}

** create a dataframe **

In [14]:
temps = pd.DataFrame(d)

In [15]:
temps

    Date  Mumbai  Paris  Tokyo
0  12-01      20     -2     15
1  12-02      18      0     19
2  12-03      23      2     15
3  12-04      19      5     11
4  12-05      25      7      9
5  12-06      27     -5      8
6  12-07      23     -3     13

In [17]:
temps.Date

0    12-01
1    12-02
2    12-03
3    12-04
4    12-05
5    12-06
6    12-07
Name: Date, dtype: object

In [18]:
type(temps.Mumbai)

pandas.core.series.Series

In [19]:
ntemp = temps['Mumbai']

In [20]:
ntemp

0    20
1    18
2    23
3    19
4    25
5    27
6    23
Name: Mumbai, dtype: int64

In [21]:
temps = temps.set_index('Date')

In [22]:
temps

       Mumbai  Paris  Tokyo
Date
12-01      20     -2     15
12-02      18      0     19
12-03      23      2     15
12-04      19      5     11
12-05      25      7      9
12-06      27     -5      8
12-07      23     -3     13

In [25]:
titanic = pd.read_csv('train.csv')

In [26]:
titanic.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [28]:
titanic.Sex.value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [29]:
titanic.Survived.value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [30]:
medals = pd.read_csv('olympicmedals.csv')

In [31]:
medals.head()

,City,Edition,Sport,Discipline,Athlete,NOC,Gender,Event,Event_gender,Medal
0,Athens,1896,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100m freestyle,M,Gold
1,Athens,1896,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100m freestyle,M,Silver
2,Athens,1896,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100m freestyle for sailors,M,Bronze
3,Athens,1896,Aquatics,Swimming,"MALOKINIS, Ioannis",GRE,Men,100m freestyle for sailors,M,Gold
4,Athens,1896,Aquatics,Swimming,"CHASAPIS, Spiridon",GRE,Men,100m freestyle for sailors,M,Silver

In [32]:
medals.Medal.value_counts()

Gold      9850
Bronze    9689
Silver    9677
Name: Medal, dtype: int64

In [33]:
medals.NOC.value_counts()

USA    4335
URS    2049
GBR    1594
FRA    1314
ITA    1228
GER    1211
AUS    1075
HUN    1053
SWE    1021
GDR     825
NED     782
JPN     704
CHN     679
RUS     638
ROU     624
CAN     592
NOR     537
POL     499
DEN     491
FRG     490
KOR     466
FIN     451
YUG     435
BEL     408
CUB     395
ESP     377
SUI     376
BRA     372
BUL     331
TCH     329
       ...
TAN       2
SUR       2
SRI       2
TJK       2
ZAM       2
MOZ       2
QAT       2
ECU       2
LUX       2
KSA       2
NIG       1
GUY       1
KUW       1
DJI       1
ISV       1
BDI       1
AHO       1
AFG       1
BER       1
TOG       1
BAR       1
ERI       1
CIV       1
IRQ       1
MKD       1
SEN       1
TGA       1
UAE       1
MRI       1
SUD       1
Name: NOC, dtype: int64

In [34]:
medals.Sport.value_counts()

Aquatics             3828
Athletics            3448
Rowing               2523
Gymnastics           2214
Fencing              1547
Football             1387
Hockey               1325
Wrestling            1140
Shooting             1105
Sailing              1061
Cycling              1025
Canoe / Kayak        1002
Basketball            940
Volleyball            910
Equestrian            894
Handball              886
Boxing                842
Weightlifting         548
Judo                  435
Baseball              335
Archery               305
Tennis                272
Rugby                 192
Softball              180
Modern Pentathlon     174
Badminton             120
Table Tennis          120
Tug of War             94
Taekwondo              80
Polo                   66
Lacrosse               59
Golf                   30
Skating                27
Ice Hockey             27
Cricket                24
Triathlon              18
Rackets                10
Croquet                 8
Water Motorsports       5
Basque Pelota           4
Roque                   3
Jeu de paume            3
Name: Sport, dtype: int64